In [1]:
import pymysql
import pandas as pd

conn = pymysql.connect(
    host="localhost",
    user="root",
    password="Verasidika19.",
    database="md_water_services"
)

df = pd.read_sql("SELECT * FROM employee LIMIT 10;", conn)
df.head()

conn.close()

C:\Users\Trevor\AppData\Local\Temp\ipykernel_9008\1701411541.py:11: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  df = pd.read_sql("SELECT * FROM employee LIMIT 10;", conn)

In [3]:
from sqlalchemy import create_engine
import pandas as pd

# build connection URL: mysql+pymysql://user:password@host/db
engine = create_engine("mysql+pymysql://root:Verasidika19.@localhost/md_water_services")

# now show tables
pd.read_sql("SHOW TABLES;", engine)

  Tables_in_md_water_services
0             data_dictionary
1                    employee
2         global_water_access
3                    location
4                      visits
5               water_quality
6                water_source
7              well_pollution

In [4]:
pd.read_sql("DESCRIBE employee;", engine)

                  Field          Type Null  Key Default Extra
0  assigned_employee_id           int   NO  PRI    None
1         employee_name  varchar(255)  YES         None
2          phone_number   varchar(15)  YES         None
3                 email  varchar(255)  YES         None
4               address  varchar(255)  YES         None
5         province_name  varchar(255)  YES         None
6             town_name  varchar(255)  YES         None
7              position  varchar(255)  YES         None

In [11]:
sql = """
SELECT 
    e.employee_name,
    COUNT(v.record_id) AS sites_visited
FROM employee e
LEFT JOIN visits v
    ON e.assigned_employee_id = v.assigned_employee_id
GROUP BY e.employee_name
ORDER BY sites_visited ASC
LIMIT 2;
"""
pd.read_sql(sql, engine)


# pd.read_sql("SHOW COLUMNS FROM employee;", engine)


# pd.read_sql("DESCRIBE visits;", engine)

  employee_name  sites_visited
0      Ayo Deka              0
1     Zuri Kofi              0

In [12]:
pd.read_sql("SELECT TRIM('33 Angelique Kidjo Avenue  ') AS trimmed;", engine)

                     trimmed
0  33 Angelique Kidjo Avenue

In [13]:
pd.read_sql("SELECT COUNT(*) AS employees_in_dahabu FROM employee WHERE town_name = 'Dahabu';", engine)

   employees_in_dahabu
0                    6

In [14]:
pd.read_sql("""
SELECT COUNT(*) AS employees_in_harare_kilimani
FROM employee
WHERE province_name = 'Harare'
  AND town_name = 'Kilimani';
""", engine)

   employees_in_harare_kilimani
0                             0

In [15]:
pd.read_sql("DESCRIBE water_source;", engine)

                     Field          Type Null  Key Default Extra
0                source_id  varchar(510)   NO  PRI    None
1     type_of_water_source  varchar(255)  YES         None
2  number_of_people_served           int  YES         None

In [16]:
pd.read_sql("""
SELECT ROUND(AVG(number_of_people_served), 0) AS avg_people_per_well
FROM water_source
WHERE type_of_water_source = 'well';
""", engine)

   avg_people_per_well
0                279.0